总支出=0
记账笔数=0
while True:
    print("========= 记账本 =========")
    print("1. 加一笔支出")
    print("2. 查看总支出")
    print("3. 查看记账笔数")
    print("4. 退出")
    选择 = input("请选择操作（1/2/3/4）：")
    if 选择=="1":
        金额=float(input("请输入金额："))
        总支出+=金额
        记账笔数+=1
        print("已计入",金额,"元")
    elif 选择=="2":
        print("总支出为：",总支出,"元")
    elif 选择=="3":
        print("总记账笔数为：",记账笔数,"笔")
    elif 选择=="4":
        print("已退出，天天开心")
        break 
    else:
        print("无效的选择，请重新输入1/2/3/4")
        